/*********************************************************************

	 파일		: SHFarmZone.h
	 작성자		: hseos
	 작성일		: 2007/04/10

	 파일설명	: 농장 지역 클래스의 헤더

 *********************************************************************/

#pragma once

#include "SHFarm.h"

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//
class CSHFarmZone : public CSHFarmObj
{
public:
	//----------------------------------------------------------------------------------------------------------------
	typedef enum										// 농장이 속한 지역
	{
		FARM_ZONE_FIRST = -1,
		FARM_ZONE_ALKER = 0,							// ..알케르 항구

		FARM_ZONE_MAX
	} FARM_ZONE;

	//----------------------------------------------------------------------------------------------------------------
	typedef enum										// 농장 지역 이벤트
	{
		FARM_ZONE_EVENT_NOTHING = 0,					// ..아무것도 아님
		FARM_ZONE_EVENT_FARM,							// ..농장
	} FARM_ZONE_EVENT;

private:
	//----------------------------------------------------------------------------------------------------------------
	CSHFarm*				m_csFarm;					// 농장			
	int						m_nFarmNum;					// 농장 개수			
	FARM_ZONE				m_eBelongZone;				// 어느 지역의 농장?
	int						m_nMapID;					// 맵 번호

public:
	//----------------------------------------------------------------------------------------------------------------
	CSHFarmZone(FARM_ZONE eBelongZone, int nMapID, int nFarmNum);
	~CSHFarmZone();

	//----------------------------------------------------------------------------------------------------------------
	//						농장 얻기
	CSHFarm*				GetFarm(WORD nFarmID)	{ return &m_csFarm[nFarmID]; }

	//						맵 번호 얻기
	int						GetMapID()				{ return m_nMapID; }

	//----------------------------------------------------------------------------------------------------------------
	//						농장 개수 얻기
	INT						GetFarmNum()			{ return m_nFarmNum; }
};
