/**************本资源来自互联网 开发者中心提示禁商业 仅学习*******************/



/*************站长 星期八 感谢广大用户对开发者中心游戏资源社区的大力支持*****************/

/**************本资源来自互联网 开发者中心提示禁商业 仅学习*******************/





/*************站长 星期八 感谢广大用户对开发者中心游戏资源社区的大力支持*****************/
// AbilityUpdater.cpp: implementation of the CAbilityUpdater class.

//


//////////////////////////////////////////////////////////////////////



#include "stdafx.h"
#include "AbilityUpdater.h"

#include "AbilityGroup.h"



//////////////////////////////////////////////////////////////////////
// Construction/Destruction
//////////////////////////////////////////////////////////////////////


CAbilityUpdater::CAbilityUpdater()
{


}



CAbilityUpdater::~CAbilityUpdater()

{



}




