/**************本资源来自互联网 开发者中心提示禁商业 仅学习*******************/


/*************站长 星期八 感谢广大用户对开发者中心游戏资源社区的大力支持*****************/
/**************本资源来自互联网 开发者中心提示禁商业 仅学习*******************/


/*************站长 星期八 感谢广大用户对开发者中心游戏资源社区的大力支持*****************/


// AbilityUse.cpp: implementation of the CAbilityUse class.
//

//////////////////////////////////////////////////////////////////////




#include "stdafx.h"
#include "AbilityUse.h"




//////////////////////////////////////////////////////////////////////
// Construction/Destruction
//////////////////////////////////////////////////////////////////////


CAbilityUse::CAbilityUse()
{



}





CAbilityUse::~CAbilityUse()

{



}





